app/views/users/index.html.erb

  <div id="tabs-3">
    <% current_user.feeds.each do |feed| %>
---
SELECT `feeds`.* FROM `feeds` WHERE `feeds`.`user_id` = 1